ekk2021/TizenRT2/os/board/rtl8721csm/src/component/os/tizenrt/tizenrt_service.c
#ifdef NEW_TIMER_WRAPPER
	if (!_tizenrt_timer_table_init) {
		INIT_LIST_HEAD(&_tizenrt_timer_table);
		_tizenrt_timer_table_init = 1;
	}

	struct _tizenrt_timer_entry *timer_entry;
	timer_entry = _tizenrt_zmalloc(sizeof(struct _tizenrt_timer_entry));
	if (timer_entry == NULL) {
		printf("%s : alloc _tizenrt_timer_entry fail \n", __FUNCTION__);
		kmm_free(timer->work_hdl);
		kmm_free(timer);
		return NULL;
	}
	memset(timer_entry, 0, sizeof(struct _tizenrt_timer_entry));
	timer_entry->timer = timer;

	save_and_cli();
	list_add(&(timer_entry->list), &_tizenrt_timer_table);
	restore_flags();
#endif

	printf("%s : [Create] Timer handle : %d\n", __FUNCTION__, timer->work_hdl);
	return (_timerHandle) timer;
}

u32 _tizenrt_timerDelete(_timerHandle xTimer, osdepTickType xBlockTime)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;

	printf("%s : [Delete] Timer handle : %d\n", __FUNCTION__, timer->work_hdl);
	int ret = work_cancel(LPWORK, timer->work_hdl);
	if (ret != OK) {
		goto cleanup;
	}

#ifdef NEW_TIMER_WRAPPER
	_list *plist;
	struct _tizenrt_timer_entry *timer_entry;
	save_and_cli();

	plist = get_next(&_tizenrt_timer_table);
	while ((_tizenrt_end_of_queue_search(&_tizenrt_timer_table, plist)) == _FALSE) {
		timer_entry = LIST_CONTAINOR(plist, struct _tizenrt_timer_entry, list);
		if (timer_entry->timer == timer) {
			list_del_init(plist);
			kmm_free(timer_entry);
			break;
		}
		plist = get_next(plist);
	}
	restore_flags();
	if (plist == &_tizenrt_timer_table) {
		printf("%s : find timer_entry fail \n", __FUNCTION__);
		return _FAIL;
	}
#endif

	timer->data = NULL;
	timer->timer_hdl = NULL;
	timer->timevalue = 0;
	timer->live = 0;
	kmm_free(timer->work_hdl);
	kmm_free(timer);
	return _SUCCESS;

cleanup:
	if (ret != -2) {
		timer->data = NULL;
		timer->timer_hdl = NULL;
		timer->timevalue = 0;
		timer->live = 0;
		kmm_free(timer->work_hdl);
		kmm_free(timer);
		DBG_ERR("_tizenrt_del_timer failed! ret = %d\n", ret);
		return _FAIL;
	}

	printf("%s : work_queue error in Timer delete \n", __FUNCTION__);
	timer->data = NULL;
	timer->timer_hdl = NULL;
	timer->timevalue = 0;
	timer->live = 0;
	kmm_free(timer->work_hdl);
	kmm_free(timer);

	return _SUCCESS;
}

u32 _tizenrt_timerIsTimerActive(_timerHandle xTimer)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;

	printf("%s : [Is_Active] Timer handle : %d, Ative Value : %d\n", __FUNCTION__, timer->work_hdl, timer->live);
	return timer->live;
}

u32 _tizenrt_timerStop(_timerHandle xTimer, osdepTickType xBlockTime)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;

	printf("%s : [Stop] Timer handle : %d\n", __FUNCTION__, timer->work_hdl);
	int ret = work_cancel(LPWORK, timer->work_hdl);
	if (ret != OK) {
		goto cleanup;
	}
	timer->timevalue = 0;
	timer->live = 0;
	return _SUCCESS;

cleanup:
	if (ret != -2) {
		kmm_free(timer->work_hdl);
		kmm_free(timer);
		DBG_ERR("_tizenrt_stop_timer failed! ret = %d", ret);
		return _FAIL;
	}
	timer->timevalue = 0;
	timer->live = 0;
	DBG_ERR("_tizenrt_stop_timer is Done! timer->work_hdl = %d\n", timer->work_hdl);
	return _SUCCESS;
}

u32 _tizenrt_timerChangePeriod(_timerHandle xTimer, osdepTickType xNewPeriod, osdepTickType xBlockTime)
{
	int ret;
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;
	printf("%s : [Change_period] Timer handle : %d, TickValue : %d\n", __FUNCTION__, timer->work_hdl, xNewPeriod);

#ifdef NEW_TIMER_WRAPPER
	ret = work_queue(LPWORK, timer->work_hdl, _tizenrt_timer_wrapper, (void *)(timer), xNewPeriod);
#else
	ret = work_queue(LPWORK, timer->work_hdl, timer->function, (void *)(timer), xNewPeriod);
#endif
	
	if (ret == -EALREADY) {
		if (work_cancel(LPWORK, timer->work_hdl) != OK) {
			goto cleanup;
		}
#ifdef NEW_TIMER_WRAPPER		
		if (work_queue(LPWORK, timer->work_hdl, _tizenrt_timer_wrapper, (void *)(timer), xNewPeriod)) {
#else
		if (work_queue(LPWORK, timer->work_hdl, timer->function, (void *)(timer), xNewPeriod)) {
#endif		
			goto cleanup;
		}
	}
	
#ifdef NEW_TIMER_WRAPPER	
	timer->live = 1;
#endif
	
	return _SUCCESS;

cleanup:
	kmm_free(timer->work_hdl);
	timer->timer_hdl = NULL;
	timer->live = 0;
	kmm_free(timer);
	DBG_ERR("_tizenrt_set_timer failed!");
	return _FAIL;
}

void *_tizenrt_timerGetID(_timerHandle xTimer)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;
	return timer->data;
}

u32 _tizenrt_timerStart(_timerHandle xTimer, osdepTickType xBlockTime)
{
	rtw_printf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerStartFromISR(_timerHandle xTimer, osdepBASE_TYPE *pxHigherPriorityTaskWoken)
{
	rtw_printf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerStopFromISR(_timerHandle xTimer, osdepBASE_TYPE *pxHigherPriorityTaskWoken)
{
	rtw_printf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerResetFromISR(_timerHandle xTimer, osdepBASE_TYPE *pxHigherPriorityTaskWoken)
{
	rtw_printf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerChangePeriodFromISR(_timerHandle xTimer, osdepTickType xNewPeriod, osdepBASE_TYPE *pxHigherPriorityTaskWoken)
{
	rtw_printf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerReset(_timerHandle xTimer, osdepTickType xBlockTime)
{
	rtw_printf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

void _tizenrt_acquire_wakelock(void)
{
}

void _tizenrt_release_wakelock(void)
{
}

void _tizenrt_wakelock_timeout(uint32_t timeout)
{
}

u8 _tizenrt_get_scheduler_state(void)
{
	rtw_printf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

static IRQ_FUN TizenUserIrqFunTable[MAX_PERIPHERAL_IRQ_NUM];
static int wrapper_IrqFun(int irq, FAR void *context, FAR void *arg)
{
	if (irq < AMEBAD_IRQ_FIRST) {
		rtw_printf("INT %d should not come here\r\n", irq);
		return OK;
	}
	__NVIC_ClearPendingIRQ(irq - AMEBAD_IRQ_FIRST);
	if (TizenUserIrqFunTable[irq - AMEBAD_IRQ_FIRST] != NULL) {
		TizenUserIrqFunTable[irq - AMEBAD_IRQ_FIRST]((VOID *)(arg));
	} else {
		rtw_printf("INT_Entry Irq %d Fun Not Assign!!!!!", irq - AMEBAD_IRQ_FIRST);
	}
	return OK;
}

